app/views/users/show.html.erb

		 <%#1:Nの関係をここで使っている、　has_manyのbooks,＠userのbooksですよ〜って#%>
		<% @user.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]